hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeov2_regs.h
/*
 * PWM1_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM1_SAFETY_MASK (0xC0000UL)
#define QEOV2_PWM_MODE_PWM1_SAFETY_SHIFT (18U)
#define QEOV2_PWM_MODE_PWM1_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM1_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM1_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM1_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM1_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM1_SAFETY_SHIFT)

/*
 * PWM0_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM0_SAFETY_MASK (0x30000UL)
#define QEOV2_PWM_MODE_PWM0_SAFETY_SHIFT (16U)
#define QEOV2_PWM_MODE_PWM0_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM0_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM0_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM0_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM0_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM0_SAFETY_SHIFT)

/*
 * ENABLE_PWM (RW)
 *
 * enable PWM force output
 * 0: disable
 * 1: enable
 */
#define QEOV2_PWM_MODE_ENABLE_PWM_MASK (0x8000U)
#define QEOV2_PWM_MODE_ENABLE_PWM_SHIFT (15U)
#define QEOV2_PWM_MODE_ENABLE_PWM_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_ENABLE_PWM_SHIFT) & QEOV2_PWM_MODE_ENABLE_PWM_MASK)
#define QEOV2_PWM_MODE_ENABLE_PWM_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_ENABLE_PWM_MASK) >> QEOV2_PWM_MODE_ENABLE_PWM_SHIFT)

/*
 * PWM_ENTER_SAFETY_MODE (RW)
 *
 * PWM  enter safety mode
 * 0: not enter
 * 1: enter
 */
#define QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_MASK (0x200U)
#define QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_SHIFT (9U)
#define QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_SHIFT) & QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_MASK)
#define QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_MASK) >> QEOV2_PWM_MODE_PWM_ENTER_SAFETY_MODE_SHIFT)

/*
 * PWM_SAFETY_BYPASS (RW)
 *
 * PWM safety mode bypass
 * 0: not bypass
 * 1: bypass
 */
#define QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_MASK (0x100U)
#define QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_SHIFT (8U)
#define QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_SHIFT) & QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_MASK)
#define QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_MASK) >> QEOV2_PWM_MODE_PWM_SAFETY_BYPASS_SHIFT)

/*
 * REVISE_UP_DN (RW)
 *
 * exchange PWM pairs’ output
 * 0: not exchange.
 * 1: exchange.
 */
#define QEOV2_PWM_MODE_REVISE_UP_DN_MASK (0x10U)
#define QEOV2_PWM_MODE_REVISE_UP_DN_SHIFT (4U)
#define QEOV2_PWM_MODE_REVISE_UP_DN_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_REVISE_UP_DN_SHIFT) & QEOV2_PWM_MODE_REVISE_UP_DN_MASK)
#define QEOV2_PWM_MODE_REVISE_UP_DN_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_REVISE_UP_DN_MASK) >> QEOV2_PWM_MODE_REVISE_UP_DN_SHIFT)

/*
 * PHASE_NUM (RW)
 *
 * pwm force phase number.
 */
#define QEOV2_PWM_MODE_PHASE_NUM_MASK (0xFU)
#define QEOV2_PWM_MODE_PHASE_NUM_SHIFT (0U)
#define QEOV2_PWM_MODE_PHASE_NUM_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PHASE_NUM_SHIFT) & QEOV2_PWM_MODE_PHASE_NUM_MASK)
#define QEOV2_PWM_MODE_PHASE_NUM_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PHASE_NUM_MASK) >> QEOV2_PWM_MODE_PHASE_NUM_SHIFT)

/* Bitfield definition for register of struct PWM: RESOLUTION */
/*
 * LINES (RW)
 *
 * pwm resolution
 */
#define QEOV2_PWM_RESOLUTION_LINES_MASK (0xFFFFFFFFUL)
#define QEOV2_PWM_RESOLUTION_LINES_SHIFT (0U)
#define QEOV2_PWM_RESOLUTION_LINES_SET(x) (((uint32_t)(x) << QEOV2_PWM_RESOLUTION_LINES_SHIFT) & QEOV2_PWM_RESOLUTION_LINES_MASK)
#define QEOV2_PWM_RESOLUTION_LINES_GET(x) (((uint32_t)(x) & QEOV2_PWM_RESOLUTION_LINES_MASK) >> QEOV2_PWM_RESOLUTION_LINES_SHIFT)

/* Bitfield definition for register of struct PWM: A */
/*
 * VAL (RW)
 *
 * pwm_a phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^32) period
 */
#define QEOV2_PWM_PHASE_SHIFT_VAL_MASK (0xFFFFFFFFUL)
#define QEOV2_PWM_PHASE_SHIFT_VAL_SHIFT (0U)
#define QEOV2_PWM_PHASE_SHIFT_VAL_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_SHIFT_VAL_SHIFT) & QEOV2_PWM_PHASE_SHIFT_VAL_MASK)
#define QEOV2_PWM_PHASE_SHIFT_VAL_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_SHIFT_VAL_MASK) >> QEOV2_PWM_PHASE_SHIFT_VAL_SHIFT)

/* Bitfield definition for register of struct PWM: POSEDGE0 */
/*
 * PWM7 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM7_MASK (0xC000U)
#define QEOV2_PWM_PHASE_TABLE_PWM7_SHIFT (14U)
#define QEOV2_PWM_PHASE_TABLE_PWM7_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM7_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM7_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM7_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM7_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM7_SHIFT)

/*
 * PWM6 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM6_MASK (0x3000U)
#define QEOV2_PWM_PHASE_TABLE_PWM6_SHIFT (12U)
#define QEOV2_PWM_PHASE_TABLE_PWM6_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM6_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM6_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM6_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM6_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM6_SHIFT)

/*
 * PWM5 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM5_MASK (0xC00U)
#define QEOV2_PWM_PHASE_TABLE_PWM5_SHIFT (10U)
#define QEOV2_PWM_PHASE_TABLE_PWM5_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM5_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM5_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM5_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM5_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM5_SHIFT)

/*
 * PWM4 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM4_MASK (0x300U)
#define QEOV2_PWM_PHASE_TABLE_PWM4_SHIFT (8U)
#define QEOV2_PWM_PHASE_TABLE_PWM4_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM4_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM4_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM4_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM4_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM4_SHIFT)

/*
 * PWM3 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM3_MASK (0xC0U)
#define QEOV2_PWM_PHASE_TABLE_PWM3_SHIFT (6U)
#define QEOV2_PWM_PHASE_TABLE_PWM3_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM3_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM3_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM3_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM3_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM3_SHIFT)

