hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeov2_regs.h
/*
 * PWM2 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM2_MASK (0x30U)
#define QEOV2_PWM_PHASE_TABLE_PWM2_SHIFT (4U)
#define QEOV2_PWM_PHASE_TABLE_PWM2_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM2_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM2_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM2_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM2_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM2_SHIFT)

/*
 * PWM1 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM1_MASK (0xCU)
#define QEOV2_PWM_PHASE_TABLE_PWM1_SHIFT (2U)
#define QEOV2_PWM_PHASE_TABLE_PWM1_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM1_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM1_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM1_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM1_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM1_SHIFT)

/*
 * PWM0 (RW)
 *
 * pwm phase table value
 */
#define QEOV2_PWM_PHASE_TABLE_PWM0_MASK (0x3U)
#define QEOV2_PWM_PHASE_TABLE_PWM0_SHIFT (0U)
#define QEOV2_PWM_PHASE_TABLE_PWM0_SET(x) (((uint32_t)(x) << QEOV2_PWM_PHASE_TABLE_PWM0_SHIFT) & QEOV2_PWM_PHASE_TABLE_PWM0_MASK)
#define QEOV2_PWM_PHASE_TABLE_PWM0_GET(x) (((uint32_t)(x) & QEOV2_PWM_PHASE_TABLE_PWM0_MASK) >> QEOV2_PWM_PHASE_TABLE_PWM0_SHIFT)

/* Bitfield definition for register: POSTION_SOFTWARE */
/*
 * POSTION_SOFTWAVE (RW)
 *
 * softwave inject postion
 */
#define QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_MASK (0xFFFFFFFFUL)
#define QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_SHIFT (0U)
#define QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_SET(x) (((uint32_t)(x) << QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_SHIFT) & QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_MASK)
#define QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_GET(x) (((uint32_t)(x) & QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_MASK) >> QEOV2_POSTION_SOFTWARE_POSTION_SOFTWAVE_SHIFT)

/* Bitfield definition for register: POSTION_SEL */
/*
 * POSTION_SEL (RW)
 *
 * enable softwave inject postion.
 * 0: disable.
 * 1: enable.
 */
#define QEOV2_POSTION_SEL_POSTION_SEL_MASK (0x1U)
#define QEOV2_POSTION_SEL_POSTION_SEL_SHIFT (0U)
#define QEOV2_POSTION_SEL_POSTION_SEL_SET(x) (((uint32_t)(x) << QEOV2_POSTION_SEL_POSTION_SEL_SHIFT) & QEOV2_POSTION_SEL_POSTION_SEL_MASK)
#define QEOV2_POSTION_SEL_POSTION_SEL_GET(x) (((uint32_t)(x) & QEOV2_POSTION_SEL_POSTION_SEL_MASK) >> QEOV2_POSTION_SEL_POSTION_SEL_SHIFT)

/* Bitfield definition for register: STATUS */
/*
 * PWM_FOURCE (RO)
 *
 * qeo_pwm_force observe
 */
#define QEOV2_STATUS_PWM_FOURCE_MASK (0xFFFF0000UL)
#define QEOV2_STATUS_PWM_FOURCE_SHIFT (16U)
#define QEOV2_STATUS_PWM_FOURCE_GET(x) (((uint32_t)(x) & QEOV2_STATUS_PWM_FOURCE_MASK) >> QEOV2_STATUS_PWM_FOURCE_SHIFT)

/*
 * PWM_SAFETY (RO)
 *
 * pwm_fault status
 */
#define QEOV2_STATUS_PWM_SAFETY_MASK (0x1U)
#define QEOV2_STATUS_PWM_SAFETY_SHIFT (0U)
#define QEOV2_STATUS_PWM_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_STATUS_PWM_SAFETY_MASK) >> QEOV2_STATUS_PWM_SAFETY_SHIFT)

/* Bitfield definition for register: DEBUG0 */
/*
 * VALUE_DAC0 (RO)
 *
 * wave0
 */
#define QEOV2_DEBUG0_VALUE_DAC0_MASK (0xFFFFFFFFUL)
#define QEOV2_DEBUG0_VALUE_DAC0_SHIFT (0U)
#define QEOV2_DEBUG0_VALUE_DAC0_GET(x) (((uint32_t)(x) & QEOV2_DEBUG0_VALUE_DAC0_MASK) >> QEOV2_DEBUG0_VALUE_DAC0_SHIFT)

/* Bitfield definition for register: DEBUG1 */
/*
 * QEO_FINISH (RO)
 *
 * qeo finish observe
 */
#define QEOV2_DEBUG1_QEO_FINISH_MASK (0x10000000UL)
#define QEOV2_DEBUG1_QEO_FINISH_SHIFT (28U)
#define QEOV2_DEBUG1_QEO_FINISH_GET(x) (((uint32_t)(x) & QEOV2_DEBUG1_QEO_FINISH_MASK) >> QEOV2_DEBUG1_QEO_FINISH_SHIFT)

/*
 * PAD_Z (RO)
 *
 * pad_z observe
 */
#define QEOV2_DEBUG1_PAD_Z_MASK (0x1000000UL)
#define QEOV2_DEBUG1_PAD_Z_SHIFT (24U)
#define QEOV2_DEBUG1_PAD_Z_GET(x) (((uint32_t)(x) & QEOV2_DEBUG1_PAD_Z_MASK) >> QEOV2_DEBUG1_PAD_Z_SHIFT)

/*
 * PAD_B (RO)
 *
 * pad_b observe
 */
#define QEOV2_DEBUG1_PAD_B_MASK (0x100000UL)
#define QEOV2_DEBUG1_PAD_B_SHIFT (20U)
#define QEOV2_DEBUG1_PAD_B_GET(x) (((uint32_t)(x) & QEOV2_DEBUG1_PAD_B_MASK) >> QEOV2_DEBUG1_PAD_B_SHIFT)

/*
 * PAD_A (RO)
 *
 * pad_a observe
 */
#define QEOV2_DEBUG1_PAD_A_MASK (0x10000UL)
#define QEOV2_DEBUG1_PAD_A_SHIFT (16U)
#define QEOV2_DEBUG1_PAD_A_GET(x) (((uint32_t)(x) & QEOV2_DEBUG1_PAD_A_MASK) >> QEOV2_DEBUG1_PAD_A_SHIFT)

/* Bitfield definition for register: DEBUG2 */
/*
 * ABZ_OWN_POSTION (RO)
 *
 * abz_own_postion observe
 */
#define QEOV2_DEBUG2_ABZ_OWN_POSTION_MASK (0xFFFFFFFFUL)
#define QEOV2_DEBUG2_ABZ_OWN_POSTION_SHIFT (0U)
#define QEOV2_DEBUG2_ABZ_OWN_POSTION_GET(x) (((uint32_t)(x) & QEOV2_DEBUG2_ABZ_OWN_POSTION_MASK) >> QEOV2_DEBUG2_ABZ_OWN_POSTION_SHIFT)

/* Bitfield definition for register: DEBUG3 */
/*
 * ABZ_OWN_POSTION (RO)
 *
 * abz_own_postion observe
 */
#define QEOV2_DEBUG3_ABZ_OWN_POSTION_MASK (0xFFFFFFFFUL)
#define QEOV2_DEBUG3_ABZ_OWN_POSTION_SHIFT (0U)
#define QEOV2_DEBUG3_ABZ_OWN_POSTION_GET(x) (((uint32_t)(x) & QEOV2_DEBUG3_ABZ_OWN_POSTION_MASK) >> QEOV2_DEBUG3_ABZ_OWN_POSTION_SHIFT)

/* Bitfield definition for register: DEBUG4 */
/*
 * VALUE_DAC1 (RO)
 *
 * wave1
 */
#define QEOV2_DEBUG4_VALUE_DAC1_MASK (0xFFFFFFFFUL)
#define QEOV2_DEBUG4_VALUE_DAC1_SHIFT (0U)
#define QEOV2_DEBUG4_VALUE_DAC1_GET(x) (((uint32_t)(x) & QEOV2_DEBUG4_VALUE_DAC1_MASK) >> QEOV2_DEBUG4_VALUE_DAC1_SHIFT)

/* Bitfield definition for register: DEBUG5 */
/*
 * VALUE_DAC2 (RO)
 *
 * wave2
 */
#define QEOV2_DEBUG5_VALUE_DAC2_MASK (0xFFFFFFFFUL)
#define QEOV2_DEBUG5_VALUE_DAC2_SHIFT (0U)
#define QEOV2_DEBUG5_VALUE_DAC2_GET(x) (((uint32_t)(x) & QEOV2_DEBUG5_VALUE_DAC2_MASK) >> QEOV2_DEBUG5_VALUE_DAC2_SHIFT)



/* PHASE_SHIFT register group index macro definition */
#define QEOV2_WAVE_PHASE_SHIFT_WAVE0 (0UL)
#define QEOV2_WAVE_PHASE_SHIFT_WAVE1 (1UL)
#define QEOV2_WAVE_PHASE_SHIFT_WAVE2 (2UL)

/* AMPLITUDE register group index macro definition */
#define QEOV2_WAVE_AMPLITUDE_WAVE0 (0UL)
#define QEOV2_WAVE_AMPLITUDE_WAVE1 (1UL)
#define QEOV2_WAVE_AMPLITUDE_WAVE2 (2UL)

/* MID_POINT register group index macro definition */
#define QEOV2_WAVE_MID_POINT_WAVE0 (0UL)
#define QEOV2_WAVE_MID_POINT_WAVE1 (1UL)
#define QEOV2_WAVE_MID_POINT_WAVE2 (2UL)

/* LIMIT0 register group index macro definition */
#define QEOV2_LIMIT0_WAVE0 (0UL)
#define QEOV2_LIMIT0_WAVE1 (1UL)
#define QEOV2_LIMIT0_WAVE2 (2UL)

/* LIMIT1 register group index macro definition */
#define QEOV2_LIMIT1_WAVE0 (0UL)
#define QEOV2_LIMIT1_WAVE1 (1UL)
#define QEOV2_LIMIT1_WAVE2 (2UL)

/* DEADZONE_SHIFT register group index macro definition */
#define QEOV2_WAVE_DEADZONE_SHIFT_WAVE0 (0UL)
#define QEOV2_WAVE_DEADZONE_SHIFT_WAVE1 (1UL)
#define QEOV2_WAVE_DEADZONE_SHIFT_WAVE2 (2UL)

/* PHASE_SHIFT register group index macro definition */
#define QEOV2_ABZ_PHASE_SHIFT_A (0UL)
#define QEOV2_ABZ_PHASE_SHIFT_B (1UL)
#define QEOV2_ABZ_PHASE_SHIFT_Z (2UL)

/* PHASE_SHIFT register group index macro definition */
#define QEOV2_PWM_PHASE_SHIFT_A (0UL)
#define QEOV2_PWM_PHASE_SHIFT_B (1UL)
#define QEOV2_PWM_PHASE_SHIFT_C (2UL)
#define QEOV2_PWM_PHASE_SHIFT_D (3UL)

/* PHASE_TABLE register group index macro definition */
#define QEOV2_PWM_PHASE_TABLE_POSEDGE0 (0UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE1 (1UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE2 (2UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE3 (3UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE4 (4UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE5 (5UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE6 (6UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE7 (7UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE8 (8UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE9 (9UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE10 (10UL)
#define QEOV2_PWM_PHASE_TABLE_POSEDGE11 (11UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE0 (12UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE1 (13UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE2 (14UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE3 (15UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE4 (16UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE5 (17UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE6 (18UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE7 (19UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE8 (20UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE9 (21UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE10 (22UL)
#define QEOV2_PWM_PHASE_TABLE_NEGEDGE11 (23UL)


#endif /* HPM_QEOV2_H */
